var scopeJson = [
  {
    "scopeId": "1",
    "label": "التدريس",
    "pointer": [
      {
        "pointerId": "1",
        "label": "تقديم تغذية راجعة للمعلمين تسهم في تحسين أدائهم."
      },
      {
        "pointerId": "2",
        "label": "مساعدة المدرسة على تنمية مهارات التفكير العليا لدى الطلبة."
      },
      {
        "pointerId": "3",
        "label": "المساهمة في توظيف نتائج التقويم الصفّي في تحسين التدريس والتعلّم."
      },
      {
        "pointerId": "4",
        "label": "المساهمة في تحسين بيئة التعلّم والإدارة الصفّية."
      },
      {
        "pointerId": "5",
        "label": "دعم المدرسة في تفعيل أدوات التعلّم الإلكتروني."
      }
    ]
  },
  {
    "scopeId": "2",
    "label": "نواتج التعلم",
    "pointer": [
      {
        "pointerId": "1",
        "label": "المساهمة في دراسة تحليل نتائج الطلبة وتقديم التغذية الراجعة لتميّز المدرسة."
      },
      {
        "pointerId": "2",
        "label": "المساهمة في تحديد أسباب تدنّي مستوى المدرسة في الاختبارات الوطنية."
      }
    ]
  },
  {
    "scopeId": "3",
    "label": "النشاط المدرسي",
    "pointer": [
      {
        "pointerId": "1",
        "label": "دعم جهود المدرسة في بناء وتنفيذ المبادرات النوعية لرفع نواتج التعلّم."
      },
      {
        "pointerId": "2",
        "label": "تعزيز جهود المدرسة في اختيار برامج وأنشطة غير صفّية لتنمية مهارات الطلبة."
      }
    ]
  },
  {
    "scopeId": "4",
    "label": "التوجيه الطلابي",
    "pointer": [
      {
        "pointerId": "1",
        "label": "المساهمة في تطوير برامج وأنشطة متنوعة لتطبيق قواعد السلوك والمواطنة."
      },
      {
        "pointerId": "2",
        "label": "نشرها لأولياء الأمور."
      },
      {
        "pointerId": "3",
        "label": "دعم جهود المدرسة بمشاركة أولياء الأمور في معالجة تدنّي نواتج التعلّم."
      }
    ]
  },
  {
    "scopeId": "5",
    "label": "التطوير المستمر",
    "pointer": [
      {
        "pointerId": "1",
        "label": "المشاركة في تحديد الاحتياجات المهنية لمنسوبي المدرسة."
      },
      {
        "pointerId": "2",
        "label": "المساهمة في تفعيل مجتمعات التعلّم المهنية."
      },
      {
        "pointerId": "3",
        "label": "المشاركة في حلقات النقاش وورش العمل."
      },
      {
        "pointerId": "4",
        "label": "تمكين المدرسة للحصول على الرخصة المهنية."
      }
    ]
  }
]



var methodJson = [
  {
    "methodId": "1",
    "label": "اجتماع"
  },
  {
    "methodId": "2",
    "label": "لقاء"
  },
  {
    "methodId": "3",
    "label": "حلقة نقاش"
  },
  {
    "methodId": "4",
    "label": "ورش عمل"
  },
  {
    "methodId": "5",
    "label": "مجتمع تعلم مهني"
  },
  {
    "methodId": "6",
    "label": "برنامج"
  },
  {
    "methodId": "7",
    "label": "تقرير"
  }
]